In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import jinja2

In [3]:
df = pd.read_csv('train.csv')
df.head()

,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,2009-06-15 17:26:21.0000001,4.5,2009-06-15 17:26:21 UTC,-73.844311,40.721319,-73.841610,40.712278,1
1,2010-01-05 16:52:16.0000002,16.9,2010-01-05 16:52:16 UTC,-74.016048,40.711303,-73.979268,40.782004,1
2,2011-08-18 00:35:00.00000049,5.7,2011-08-18 00:35:00 UTC,-73.982738,40.761270,-73.991242,40.750562,2
3,2012-04-21 04:30:42.0000001,7.7,2012-04-21 04:30:42 UTC,-73.987130,40.733143,-73.991567,40.758092,1
4,2010-03-09 07:51:00.000000135,5.3,2010-03-09 07:51:00 UTC,-73.968095,40.768008,-73.956655,40.783762,1

In [4]:
df1 = df.drop('key',axis=1)
df1.head()

,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
0,4.5,2009-06-15 17:26:21 UTC,-73.844311,40.721319,-73.841610,40.712278,1
1,16.9,2010-01-05 16:52:16 UTC,-74.016048,40.711303,-73.979268,40.782004,1
2,5.7,2011-08-18 00:35:00 UTC,-73.982738,40.761270,-73.991242,40.750562,2
3,7.7,2012-04-21 04:30:42 UTC,-73.987130,40.733143,-73.991567,40.758092,1
4,5.3,2010-03-09 07:51:00 UTC,-73.968095,40.768008,-73.956655,40.783762,1

In [5]:
df1.shape

(50000, 7)

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   fare_amount        50000 non-null  float64
 1   pickup_datetime    50000 non-null  object
 2   pickup_longitude   50000 non-null  float64
 3   pickup_latitude    50000 non-null  float64
 4   dropoff_longitude  50000 non-null  float64
 5   dropoff_latitude   50000 non-null  float64
 6   passenger_count    50000 non-null  int64
dtypes: float64(5), int64(1), object(1)
memory usage: 2.7+ MB

pickup datetime is object but should be datetime so need to be converted

we're predicting fare

In [7]:
df1.isnull().sum()

fare_amount          0
pickup_datetime      0
pickup_longitude     0
pickup_latitude      0
dropoff_longitude    0
dropoff_latitude     0
passenger_count      0
dtype: int64

In [8]:
df1.pickup_datetime = pd.to_datetime(df1.pickup_datetime)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   fare_amount        50000 non-null  float64
 1   pickup_datetime    50000 non-null  datetime64[ns, UTC]
 2   pickup_longitude   50000 non-null  float64
 3   pickup_latitude    50000 non-null  float64
 4   dropoff_longitude  50000 non-null  float64
 5   dropoff_latitude   50000 non-null  float64
 6   passenger_count    50000 non-null  int64
dtypes: datetime64[ns, UTC](1), float64(5), int64(1)
memory usage: 2.7 MB

In [9]:
df1.pickup_datetime.head(3)

0   2009-06-15 17:26:21+00:00
1   2010-01-05 16:52:16+00:00
2   2011-08-18 00:35:00+00:00
Name: pickup_datetime, dtype: datetime64[ns, UTC]

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   fare_amount        50000 non-null  float64
 1   pickup_datetime    50000 non-null  datetime64[ns, UTC]
 2   pickup_longitude   50000 non-null  float64
 3   pickup_latitude    50000 non-null  float64
 4   dropoff_longitude  50000 non-null  float64
 5   dropoff_latitude   50000 non-null  float64
 6   passenger_count    50000 non-null  int64
dtypes: datetime64[ns, UTC](1), float64(5), int64(1)
memory usage: 2.7 MB

In [11]:
df1 = df1.assign(
    hour = df1.pickup_datetime.dt.hour,
    minute = df1.pickup_datetime.dt.minute,
    month = df1.pickup_datetime.dt.month,
    year = df1.pickup_datetime.dt.year,
    day = df1.pickup_datetime.dt.day,
    dayofweek = df1.pickup_datetime.dt.dayofweek,
)

In [12]:
df1.head()

,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,hour,minute,month,year,day,dayofweek
0,4.5,2009-06-15 17:26:21+00:00,-73.844311,40.721319,-73.841610,40.712278,1,17,26,6,2009,15,0
1,16.9,2010-01-05 16:52:16+00:00,-74.016048,40.711303,-73.979268,40.782004,1,16,52,1,2010,5,1
2,5.7,2011-08-18 00:35:00+00:00,-73.982738,40.761270,-73.991242,40.750562,2,0,35,8,2011,18,3
3,7.7,2012-04-21 04:30:42+00:00,-73.987130,40.733143,-73.991567,40.758092,1,4,30,4,2012,21,5
4,5.3,2010-03-09 07:51:00+00:00,-73.968095,40.768008,-73.956655,40.783762,1,7,51,3,2010,9,1

In [13]:
df1.shape

(50000, 13)

In [14]:
df1.drop('pickup_datetime',axis=1,inplace=True)
df1.shape

(50000, 12)

In [15]:
df1.head()

,fare_amount,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,hour,minute,month,year,day,dayofweek
0,4.5,-73.844311,40.721319,-73.841610,40.712278,1,17,26,6,2009,15,0
1,16.9,-74.016048,40.711303,-73.979268,40.782004,1,16,52,1,2010,5,1
2,5.7,-73.982738,40.761270,-73.991242,40.750562,2,0,35,8,2011,18,3
3,7.7,-73.987130,40.733143,-73.991567,40.758092,1,4,30,4,2012,21,5
4,5.3,-73.968095,40.768008,-73.956655,40.783762,1,7,51,3,2010,9,1

To improve accuracy we can calculate distance travelled from longitude and latitude

In [16]:
from math import radians, cos, sin, asin, sqrt
def distance(lat1, lat2, lon1, lon2):
     
    travel = []

    for i in range(len(lat1)):
        
        long1 = radians(lon1[i])
        long2 = radians(lon2[i])
        lati1 = radians(lat1[i])
        lati2 = radians(lat2[i])
      
        # Haversine formula
        dlon = long2 - long1
        dlat = lati2 - lati1
        a = sin(dlat / 2)**2 + cos(lat1) * cos(lat2) * sin(dlon / 2)**2
    
        c = 2 * asin(sqrt(a))
        
        # Radius of earth in kilometers. Use 3956 for miles!
        r = 6371
        dist = c*r
      
    # calculate the result
    return dist

In [19]:
df1.apply(lambda)

TypeError: only size-1 arrays can be converted to Python scalars